"noInternetConnectionError" = "يبدو أنك غير متصل بالإنترنت. يرجى التحقق من اتصالك بالإنترنت والمحاولة مرة أخرى";
"timeoutError" = "عذرًا، استغرقت العملية وقتًا أطول من المتوقع. يرجى التحقق من اتصالك بالإنترنت والمحاولة مرة أخرى. إذا استمرت المشكلة، يرجى الاتصال بالدعم.";
"invalidURLError" = "الرابط الذي قدمته غير صالح %@. يرجى التحقق مرة أخرى من الرابط والمحاولة مرة أخرى، أو الاتصال بالدعم إذا استمرت المشكلة.";
"requestFailedError" = "حدث خطأ ما في الشبكة. يرجى التحقق من اتصالك، والمحاولة مرة أخرى لاحقًا، أو الاتصال بالدعم إذا استمرت المشكلة.";
"encodingDataError" = "غير قادر على ترميز بيانات الطلب.";
"decodingFailedError" = "حدث خطأ في بيانات الخادم، يرجى المحاولة مرة أخرى لاحقًا، أو الاتصال بالدعم إذا استمرت المشكلة.";
"serverError" = "عذرًا، واجهنا خطأ في استجابة الخادم، يرجى المحاولة مرة أخرى لاحقًا.";

